In [1]:
import pandas as pd

In [2]:
data=pd.read_csv("text.csv")

In [3]:
data

    name  age desin  salary
0   somu   21    ml  125554
1  sunny   22    ai    5655
2  monic   15   web    2555

In [5]:
data.shape

(3, 4)

In [7]:
data.dtypes

name      object
age        int64
desin     object
salary     int64
dtype: object

In [8]:
data.head(2)

    name  age desin  salary
0   somu   21    ml  125554
1  sunny   22    ai    5655

In [10]:
data.tail(1)

    name  age desin  salary
2  monic   15   web    2555

In [14]:
data.sample(n=2)

    name  age desin  salary
2  monic   15   web    2555
0   somu   21    ml  125554

In [16]:
data.values

array([['somu', 21, 'ml', 125554],
       ['sunny', 22, 'ai', 5655],
       ['monic', 15, 'web', 2555]], dtype=object)

In [17]:
data.size # number os column and row

12

In [19]:
data.ndim # dimantion

2

In [20]:
data.axes

[RangeIndex(start=0, stop=3, step=1),
 Index(['name', 'age', 'desin', 'salary'], dtype='object')]